{
  "id": 45,
  "status": "done",
  "title": "Meetup #45",
  "date": "20/06/2019",
  "image": "jhipster.png",
  "ticketsUrl": "https://www.eventbrite.fr/e/meetup-42-tickets-63375292205",
  "hosting": 29,
  "sponsor": 12,
  "talks": [
    {
      "title": "JHipster: Spring boot and Angular/React/Vue.js in one handy generator",
      "description": "JHipster est une plateforme de développement Open Source permettant de générer, développer et déployer des applications web : Spring boot et Angular ou React ou depuis peu Vue.js dans une application monolithique ou suivant le pattern microservices. Offrant des dizaines d’options qui vous permettent de générer une application adaptée à vos besoins et vos envies, JHipster porte une attention toute particulière à l’expérience du développeur et à la qualité du code généré. De la génération à la mise en production JHipster est l&#x27;outil qu&#x27;il vous faut afin d&#x27;accélérer le développement et le déploiement de vos projets.",
      "speakers": [
        {
          "name": "Anthony Viard",
          "link": "avdev4j"
        }
      ]
    },
    {
      "title": "JHipster et Vue.js",
      "description": "Depuis quelques semaines, JHipster et Vue.js, c’est désormais possible. De Vue Router à Vuex, en passant par TypeScript et Vue Class Component, sans oublier Jest et Protractor, découvrons ensemble comment construire une véritable application avec Vue.js et JHipster. La NASA a besoin de nous, après le live youtube en continu depuis l&#x27;ISS, l&#x27;agence spatiale américaine veut proposer aux utilisateurs de situer exactement l&#x27;ISS en temps réel. Et cela doit être en production ce soir ! Découvrons ensemble comment proposer une véritable application profitant au maximum de la puissance de Spring Boot tout en disposant d&#x27;un front performant. Grâce à JHipster et l&#x27;intégration Vue.js, répondons ensemble à ce besoin.",
      "speakers": [
        {
          "name": "Hippolyte Durix",
          "link": "hdurix"
        },
        {
          "name": "Anthony Viard",
          "link": "avdev4j"
        }
      ]
    }
  ]
}
