{
  "id": 76,
  "status": "done",
  "title": "Meetup #76",
  "date": "20/04/2023",
  "image": "typescript.svg",
  "ticketsUrl": "https://www.eventbrite.fr/e/billets-meetup-72-615540828187",
  "remote": true,
  "hosting": 21,
  "sponsor": 23,
  "talks": [
    {
      "title": "Je ne suis pas passionné(e) et alors ?!",
      "description": "Tout le monde connait ce développeur, cette développeuse passionné(e) par son métier.Facilement reconnaissable du fait qu'il/elle passe des heures à coder, même en dehors du travail; se documente; dont les sujets de conversation tournent souvent autour du code. Quand bien même passionné(e), il arrive qu'on ne ressente, ni n'exprime cette passion pour le code. Et facilement, à son contact, le sentiment de malaise peut survenir si on ne ressent pas cette passion. Et ce, même en étant soi-même développeur ou développeuse. Ce malaise peut être source d'inquiétude, de doute par rapport à ses propres compétences. En effet, si le passionné consacre des heures à des projets personnels, peut-être le devrions-nous ? L'injonction à la passion dans le dev ne serait-elle pas en fin de compte un piège ? La passion est-elle LE logiciel indispensable à toute personne souhaitant coder ? Ici, tout l'objet de cette conférence !",
      "speakers": [
        {
          "name": "Helvira Goma",
          "link": "helvira_g"
        }
      ]
    },
    {
      "title": "Typesafe all the things: typage fort de la base de données jusqu'au client gràce à TypeScript, tRPC & prisma",
      "description": "Vous maintenez des interfaces synchronisées entre votre back et votre front ? c'est lourd non ? Peut-être avez vous besoin d'une étape de génération lors d'un changement de modèle de données de vos API's ? Le saviez-vous ? : on peut aujourd'hui se passer de tout cela. Découvrez une stack technique utilisant la puissance de typescript au service de l'expérience développeur et de la simplicité: - tRPC pour une API et son client sans schémas ni génération de code. - prisma pour un ORM supportant de nombreuses bases de données et orienté typescript first.",
      "speakers": [
        {
          "name": "Benjamin Legrand",
          "link": "benjilegnard"
        }
      ]
    }
  ]
}
